src/cfe/Documents/ЕИС_ТранспортныйКонтейнер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЕИС_ТранспортныйКонтейнер</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕИС_Контракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.еисКонтракты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕИС_ТекущийЭтап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.еисЭтапы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНаПечать</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаПечать</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусУПД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгрузкаЗаМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕИС_КонтрактныйТовар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.еисКонтрактныеТовары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоКонтракту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоКонтракту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗавершениеАктирования</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрикрепленныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.еисВидыПрикрепленныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШтрихкодыУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/Enums/еисСтатусЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>еисСтатусЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбработанУспешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработанСОшибками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Documents/ЕИС_ТранспортныйКонтейнер/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьНадписи();
	Если еисСтатусЗапроса = Перечисления.еисСтатусЗапроса.ОбработанУспешно Тогда
		ТолькоПросмотр = Истина;	
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ОбновитьНадписи()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = ГМ_ЕИС.ПоследнийЗапрос(Объект.Ссылка);
	Если Запрос <> Неопределено Тогда
		ApplicationID = Запрос.ApplicationID;
		еисСтатусЗапроса = Запрос.СтатусЗапроса;
		
		Если ЗначениеЗаполнено( Запрос.Ошибка ) Тогда
			Элементы.ГруппаОшибки.Видимость = Истина;
			Ошибки = Запрос.Ошибка;
		Иначе
			Элементы.ГруппаОшибки.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ИнфоСтатусДокумента = ГМ_ЕИС.СтатусДокументаЕИС(Объект.Ссылка);
	ИдДокЕИС = ИнфоСтатусДокумента.еисИдДокумента;
	СтатусДокумента = ИнфоСтатусДокумента.СтатусДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВЕИС(Команда)
	
	ПараметрыОрганизации = ГМ_ЕИС.ПолучитьСтруктуруПараметров(Объект.Организация);
	Компонента = ЕИС_Клиент.ИнициализацияКомпоненты(ПараметрыОрганизации);
	
	ФайлыКОтправке = ГМ_ЕИС.ПодготовитьСписокФайловКОтправке(Объект.Ссылка);
	ПрикрепленныеФайлы_ = Новый Массив;
	Для Каждого стрФайл Из ФайлыКОтправке Цикл
		
		Файл = ЕИС_Клиент.ОтправитьФайлы(Компонента, стрФайл, ПараметрыОрганизации);
		
		Если ЗначениеЗаполнено(Файл.id) Тогда
			ПрикрепленныеФайлы_.Добавить(Файл);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеПакета = ГМ_ЕИС.СформироватьПакетЕИС(Ложь, Объект.Ссылка, Истина, ПараметрыОрганизации, ПрикрепленныеФайлы_);
	Если Не ДанныеПакета.ОшибкаФормирования Тогда
		Для Каждого Файл Из  ДанныеПакета.ФайлыПакета Цикл
			тхт = Новый ТекстовыйДокумент;
			тхт.ДобавитьСтроку(Файл.Запрос);
			тхт.Записать(Файл.ИмяФайла, КодировкаТекста.ANSI);
			Если ПараметрыОрганизации["ВыводитьПодробнуюИнформацию"] Тогда
				ЕИС_Клиент.СообщитьИнфо(ТекущаяДата() + " Записан файл: "+Файл.ИмяФайла);
			КонецЕсли;
		КонецЦикла;
		
		ИмяФайлаПакет = ЕИС_Клиент.СохранитьПакет(Компонента, ДанныеПакета);
		
		Если ЗначениеЗаполнено(ИмяФайлаПакет) Тогда
			ЕИС_Клиент.Отправить(Компонента, ПараметрыОрганизации, ИмяФайлаПакет, ДанныеПакета.ApplicationId, Объект.Ссылка, Ложь);
		КонецЕсли;
	Иначе
		ЕИС_Клиент.СообщитьИнфо("При формировании пакета по документу["+Объект.Ссылка+"] выявлены ошибки, документ не отправлен!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОтветЕИС(Команда)
	
	ПараметрыОрганизации = ГМ_ЕИС.ПолучитьСтруктуруПараметров(Объект.Организация);

	Компонента = ЕИС_Клиент.ИнициализацияКомпоненты(ПараметрыОрганизации);
	
	ОчиститьСообщения();
	ЕИС_Клиент.ПолучитьОтвет(Компонента, 0, Объект.Ссылка, , ПараметрыОрганизации);
	
	ОбновитьНадписи();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапрос(Команда)
	
	ЕИС_Клиент.ОткрытьЗапросЕИС(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтвет(Команда)
	
	ЕИС_Клиент.ОткрытьОтветЕИС(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Модифицированность = Ложь;
	Записать();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	
	Модифицированность = Ложь;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕИС_ТекущийЭтапНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора = Новый Структура("Владелец", Объект.ЕИС_Контракт);
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, Отбор", Истина, Истина, ЗначениеОтбора);	
	ОткрытьФорму("Справочник.еисЭтапы.ФормаВыбора", ПараметрыПодбора, Элемент);	

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусДокумента(Команда)
		
	ПараметрыОрганизации = ГМ_ЕИС.ПолучитьСтруктуруПараметров(Объект.Организация);

	Компонента = ЕИС_Клиент.ИнициализацияКомпоненты(ПараметрыОрганизации);
	
	ОчиститьСообщения();
	ЕИС_Клиент.ПолучитьДанныеПоДокументу(Объект.Ссылка, Компонента, ПараметрыОрганизации);
	
	ОбновитьНадписи();
	
КонецПроцедуры

&НаСервере
Функция ТоварыЕИС_КонтрактныйТоварПриИзмененииНаСервере(КонтрактныйТовар, Номенклатура)
	
	Если ЗначениеЗаполнено(КонтрактныйТовар) И ЗначениеЗаполнено(Номенклатура) Тогда
		КодТовараЕИС = ?(ЗначениеЗаполнено(КонтрактныйТовар.ОКПД2Код), 
				КонтрактныйТовар.ОКПД2Код, КонтрактныйТовар.КТРУКод);
				
		ГМ_ЕИС.ЗаписатьСоответствиеТоваров(Номенклатура, КонтрактныйТовар);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтрактныйТовар) Тогда
		ЦенаПоКонтракту = КонтрактныйТовар.Цена * 
			?(КонтрактныйТовар.КоличПотребЕдВПотребУпак = 0, 1, КонтрактныйТовар.КоличПотребЕдВПотребУпак);
	Иначе
		ЦенаПоКонтракту = 0;
	КонецЕсли;
	
	Возврат ЦенаПоКонтракту;
	
КонецФункции

&НаКлиенте
Процедура ТоварыЕИС_КонтрактныйТоварПриИзменении(Элемент)
	
	ТекСтр = Элементы.Товары.ТекущиеДанные;
	Номенклатура = ?(ЗначениеЗаполнено(ТекСтр.Содержание), ТекСтр.Содержание, ТекСтр.Номенклатура);
	ТекСтр.ЦенаПоКонтракту = ТоварыЕИС_КонтрактныйТоварПриИзмененииНаСервере(ТекСтр.ЕИС_КонтрактныйТовар, Номенклатура) * ТекСтр.Коэффициент;
    ТекСтр.СуммаПоКонтракту = ТекСтр.ЦенаПоКонтракту * ТекСтр.Количество * ТекСтр.Коэффициент;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	РежимДиалога = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	ДиалогВыбораФайла.МножественныйВыбор = Истина;
	ДиалогВыбораФайла.Заголовок = Нстр("ru = 'Выберите файл'");
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Для Каждого Файл Из ДиалогВыбораФайла.ВыбранныеФайлы Цикл
			НайденныеСтроки = Объект.ПрикрепленныеФайлы.НайтиСтроки(Новый Структура("Путь", Файл));
			Если Не НайденныеСтроки.Количество() Тогда
				нСтр = Объект.ПрикрепленныеФайлы.Добавить();
				нСтр.Путь = Файл;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьНеСопоставленные(Команда)
	
	Элементы.Товары.ОтборСтрок = Неопределено;
	
	УстановленОтборТовары = Не УстановленОтборТовары;
	Если УстановленОтборТовары Тогда
		ЗначениеОтбора = Новый ФиксированнаяСтруктура("ЕИС_КонтрактныйТовар", ПредопределенноеЗначение("Справочник.еисКонтрактныеТовары.ПустаяСсылка"));
		Элементы.ТоварыОтобразитьНеСопоставленные.Заголовок = "Показать все";
	Иначе
		ЗначениеОтбора = Неопределено;
		Элементы.ТоварыОтобразитьНеСопоставленные.Заголовок = "Показать не сопоставленные";
	КонецЕсли;
	
	Элементы.Товары.ОтборСтрок = ЗначениеОтбора;
	
КонецПроцедуры
